vpecanins/lpc54608_demos/board/pin_mux.h
/*! @name LCD_VD(22) (coord A7), J16[27]/P3_8-LCD_VD22
  @{ */
#define BOARD_INITPINS_LCD_VD22_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD22_SIGNAL LCD_VD                 /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD22_CHANNEL 22                    /*!<@brief LCD LCD_VD channel: 22 */
#define BOARD_INITPINS_LCD_VD22_PIN_NAME LCD_VD(22)           /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD22_LABEL "J16[27]/P3_8-LCD_VD22" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD22_NAME "LCD_VD22"               /*!<@brief Identifier name */
                                                              /* @} */

/*! @name LCD_VD(23) (coord C7), J16[28]/P3_9-LCD_VD23
  @{ */
#define BOARD_INITPINS_LCD_VD23_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD23_SIGNAL LCD_VD                 /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD23_CHANNEL 23                    /*!<@brief LCD LCD_VD channel: 23 */
#define BOARD_INITPINS_LCD_VD23_PIN_NAME LCD_VD(23)           /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD23_LABEL "J16[28]/P3_9-LCD_VD23" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD23_NAME "LCD_VD23"               /*!<@brief Identifier name */
                                                              /* @} */

/*! @name LCD_PWR (coord K3), J16[31]/P2_11-LCD_PWR
  @{ */
#define BOARD_INITPINS_LCD_PWR_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_PWR_SIGNAL LCD_PWR                /*!<@brief LCD signal: LCD_PWR */
#define BOARD_INITPINS_LCD_PWR_PIN_NAME LCD_PWR              /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_PWR_LABEL "J16[31]/P2_11-LCD_PWR" /*!<@brief Label */
#define BOARD_INITPINS_LCD_PWR_NAME "LCD_PWR"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name LCD_DCLK (coord P7), J16[30]/P2_13-LCD_DCLK
  @{ */
#define BOARD_INITPINS_LCD_DCLK_PERIPHERAL LCD                 /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_DCLK_SIGNAL LCD_DCLK                /*!<@brief LCD signal: LCD_DCLK */
#define BOARD_INITPINS_LCD_DCLK_PIN_NAME LCD_DCLK              /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_DCLK_LABEL "J16[30]/P2_13-LCD_DCLK" /*!<@brief Label */
#define BOARD_INITPINS_LCD_DCLK_NAME "LCD_DCLK"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name LCD_FP (coord L7), J16[33]/P2_14-LCD_FP
  @{ */
#define BOARD_INITPINS_LCD_FP_PERIPHERAL LCD               /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_FP_SIGNAL LCD_FP                /*!<@brief LCD signal: LCD_FP */
#define BOARD_INITPINS_LCD_FP_PIN_NAME LCD_FP              /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_FP_LABEL "J16[33]/P2_14-LCD_FP" /*!<@brief Label */
#define BOARD_INITPINS_LCD_FP_NAME "LCD_FP"                /*!<@brief Identifier name */
                                                           /* @} */

/*! @name LCD_AC (coord M8), J16[34]/P2_15-LCD_AC_ENAB_M
  @{ */
/*!
 * @brief Device name: LCD */
#define BOARD_INITPINS_LCD_AC_ENAB_M_PERIPHERAL LCD
/*!
 * @brief LCD signal: LCD_AC */
#define BOARD_INITPINS_LCD_AC_ENAB_M_SIGNAL LCD_AC
/*!
 * @brief Pin name */
#define BOARD_INITPINS_LCD_AC_ENAB_M_PIN_NAME LCD_AC
/*!
 * @brief Label */
#define BOARD_INITPINS_LCD_AC_ENAB_M_LABEL "J16[34]/P2_15-LCD_AC_ENAB_M"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_LCD_AC_ENAB_M_NAME "LCD_AC_ENAB_M"
/* @} */

/*! @name LCD_LP (coord L8), J16[32]/P2_16-LCD_LP
  @{ */
#define BOARD_INITPINS_LCD_LP_PERIPHERAL LCD               /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_LP_SIGNAL LCD_LP                /*!<@brief LCD signal: LCD_LP */
#define BOARD_INITPINS_LCD_LP_PIN_NAME LCD_LP              /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_LP_LABEL "J16[32]/P2_16-LCD_LP" /*!<@brief Label */
#define BOARD_INITPINS_LCD_LP_NAME "LCD_LP"                /*!<@brief Identifier name */
                                                           /* @} */

/*! @name SWO (coord P2), U16[12]/SWO_TRGT
  @{ */
#define BOARD_INITPINS_SWO_TRGT_PERIPHERAL SWD           /*!<@brief Device name: SWD */
#define BOARD_INITPINS_SWO_TRGT_SIGNAL SWO               /*!<@brief SWD signal: SWO */
#define BOARD_INITPINS_SWO_TRGT_PIN_NAME SWO             /*!<@brief Pin name */
#define BOARD_INITPINS_SWO_TRGT_LABEL "U16[12]/SWO_TRGT" /*!<@brief Label */
#define BOARD_INITPINS_SWO_TRGT_NAME "SWO_TRGT"          /*!<@brief Identifier name */
                                                         /* @} */

/*! @name EMC_D(5) (coord H12), U28[D9]/RP5[3]/P0_7-EMC_D5
  @{ */
#define BOARD_INITPINS_EMC_D5_PERIPHERAL EMC                     /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D5_SIGNAL EMC_D                       /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D5_CHANNEL 5                          /*!<@brief EMC EMC_D channel: 5 */
#define BOARD_INITPINS_EMC_D5_PIN_NAME EMC_D(5)                  /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D5_LABEL "U28[D9]/RP5[3]/P0_7-EMC_D5" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D5_NAME "EMC_D5"                      /*!<@brief Identifier name */
                                                                 /* @} */

/*! @name EMC_D(6) (coord H10), U28[D8]/RP5[2]/P0_8-EMC_D6
  @{ */
#define BOARD_INITPINS_EMC_D6_PERIPHERAL EMC                     /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D6_SIGNAL EMC_D                       /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D6_CHANNEL 6                          /*!<@brief EMC EMC_D channel: 6 */
#define BOARD_INITPINS_EMC_D6_PIN_NAME EMC_D(6)                  /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D6_LABEL "U28[D8]/RP5[2]/P0_8-EMC_D6" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D6_NAME "EMC_D6"                      /*!<@brief Identifier name */
                                                                 /* @} */

/*! @name EMC_D(7) (coord G12), U28[E9]/RP5[1]/P0_9-EMC_D7
  @{ */
#define BOARD_INITPINS_EMC_D7_PERIPHERAL EMC                     /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D7_SIGNAL EMC_D                       /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D7_CHANNEL 7                          /*!<@brief EMC EMC_D channel: 7 */
#define BOARD_INITPINS_EMC_D7_PIN_NAME EMC_D(7)                  /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D7_LABEL "U28[E9]/RP5[1]/P0_9-EMC_D7" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D7_NAME "EMC_D7"                      /*!<@brief Identifier name */
                                                                 /* @} */

/*! @name EMC_WEN (coord L4), U28[F9]/P0_15-EMC_WEn
  @{ */
#define BOARD_INITPINS_EMC_WEn_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_WEn_SIGNAL EMC_WE                 /*!<@brief EMC signal: EMC_WE */
#define BOARD_INITPINS_EMC_WEn_PIN_NAME EMC_WEN              /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_WEn_LABEL "U28[F9]/P0_15-EMC_WEn" /*!<@brief Label */
#define BOARD_INITPINS_EMC_WEn_NAME "EMC_WEn"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name EMC_A(0) (coord C14), U28[H7]/P0_18-EMC_A0
  @{ */
#define BOARD_INITPINS_EMC_A0_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A0_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A0_CHANNEL 0                    /*!<@brief EMC EMC_A channel: 0 */
#define BOARD_INITPINS_EMC_A0_PIN_NAME EMC_A(0)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A0_LABEL "U28[H7]/P0_18-EMC_A0" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A0_NAME "EMC_A0"                /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_A(1) (coord C6), U28[H8]/P0_19-EMC_A1
  @{ */
#define BOARD_INITPINS_EMC_A1_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A1_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A1_CHANNEL 1                    /*!<@brief EMC EMC_A channel: 1 */
#define BOARD_INITPINS_EMC_A1_PIN_NAME EMC_A(1)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A1_LABEL "U28[H8]/P0_19-EMC_A1" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A1_NAME "EMC_A1"                /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_A(2) (coord D13), U28[J8]/P0_20-EMC_A2
  @{ */
#define BOARD_INITPINS_EMC_A2_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A2_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A2_CHANNEL 2                    /*!<@brief EMC EMC_A channel: 2 */
#define BOARD_INITPINS_EMC_A2_PIN_NAME EMC_A(2)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A2_LABEL "U28[J8]/P0_20-EMC_A2" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A2_NAME "EMC_A2"                /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_A(3) (coord C13), U28[J7]/P0_21-EMC_A3
  @{ */
#define BOARD_INITPINS_EMC_A3_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A3_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A3_CHANNEL 3                    /*!<@brief EMC EMC_A channel: 3 */
#define BOARD_INITPINS_EMC_A3_PIN_NAME EMC_A(3)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A3_LABEL "U28[J7]/P0_21-EMC_A3" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A3_NAME "EMC_A3"                /*!<@brief Identifier name */
                                                           /* @} */

