vpecanins/lpc54608_demos/board/pin_mux.h
/*! @name EMC_D(11) (coord D4), U28[C2]/RP4[1]/P1_4-EMC_D11
  @{ */
#define BOARD_INITPINS_EMC_D11_PERIPHERAL EMC                      /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D11_SIGNAL EMC_D                        /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D11_CHANNEL 11                          /*!<@brief EMC EMC_D channel: 11 */
#define BOARD_INITPINS_EMC_D11_PIN_NAME EMC_D(11)                  /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D11_LABEL "U28[C2]/RP4[1]/P1_4-EMC_D11" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D11_NAME "EMC_D11"                      /*!<@brief Identifier name */
                                                                   /* @} */

/*! @name EMC_A(4) (coord E4), U28[J3]/P1_5-EMC_A4
  @{ */
#define BOARD_INITPINS_EMC_A4_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A4_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A4_CHANNEL 4                   /*!<@brief EMC EMC_A channel: 4 */
#define BOARD_INITPINS_EMC_A4_PIN_NAME EMC_A(4)           /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A4_LABEL "U28[J3]/P1_5-EMC_A4" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A4_NAME "EMC_A4"               /*!<@brief Identifier name */
                                                          /* @} */

/*! @name EMC_A(5) (coord G4), U28[J2]/P1_6-EMC_A5
  @{ */
#define BOARD_INITPINS_EMC_A5_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A5_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A5_CHANNEL 5                   /*!<@brief EMC EMC_A channel: 5 */
#define BOARD_INITPINS_EMC_A5_PIN_NAME EMC_A(5)           /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A5_LABEL "U28[J2]/P1_6-EMC_A5" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A5_NAME "EMC_A5"               /*!<@brief Identifier name */
                                                          /* @} */

/*! @name EMC_A(6) (coord N1), U28[H3]/P1_7-EMC_A6
  @{ */
#define BOARD_INITPINS_EMC_A6_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A6_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A6_CHANNEL 6                   /*!<@brief EMC EMC_A channel: 6 */
#define BOARD_INITPINS_EMC_A6_PIN_NAME EMC_A(6)           /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A6_LABEL "U28[H3]/P1_7-EMC_A6" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A6_NAME "EMC_A6"               /*!<@brief Identifier name */
                                                          /* @} */

/*! @name EMC_A(7) (coord P8), U28[H2]/P1_8-EMC_A7
  @{ */
#define BOARD_INITPINS_EMC_A7_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A7_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A7_CHANNEL 7                   /*!<@brief EMC EMC_A channel: 7 */
#define BOARD_INITPINS_EMC_A7_PIN_NAME EMC_A(7)           /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A7_LABEL "U28[H2]/P1_8-EMC_A7" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A7_NAME "EMC_A7"               /*!<@brief Identifier name */
                                                          /* @} */

/*! @name EMC_CASN (coord K6), U28[F7]/P1_9-EMC_CASn
  @{ */
#define BOARD_INITPINS_EMC_CASn_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_CASn_SIGNAL EMC_CAS                /*!<@brief EMC signal: EMC_CAS */
#define BOARD_INITPINS_EMC_CASn_PIN_NAME EMC_CASN             /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_CASn_LABEL "U28[F7]/P1_9-EMC_CASn" /*!<@brief Label */
#define BOARD_INITPINS_EMC_CASn_NAME "EMC_CASn"               /*!<@brief Identifier name */
                                                              /* @} */

/*! @name EMC_RASN (coord N9), U28[F8]/P1_10-EMC_RASn
  @{ */
#define BOARD_INITPINS_EMC_RASn_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_RASn_SIGNAL EMC_RAS                 /*!<@brief EMC signal: EMC_RAS */
#define BOARD_INITPINS_EMC_RASn_PIN_NAME EMC_RASN              /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_RASn_LABEL "U28[F8]/P1_10-EMC_RASn" /*!<@brief Label */
#define BOARD_INITPINS_EMC_RASn_NAME "EMC_RASn"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name EMC_CLK(0) (coord B4), U28[F2]/P1_11-EMC_CLK0
  @{ */
#define BOARD_INITPINS_EMC_CLK0_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_CLK0_SIGNAL EMC_CLK                 /*!<@brief EMC signal: EMC_CLK */
#define BOARD_INITPINS_EMC_CLK0_CHANNEL 0                      /*!<@brief EMC EMC_CLK channel: 0 */
#define BOARD_INITPINS_EMC_CLK0_PIN_NAME EMC_CLK(0)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_CLK0_LABEL "U28[F2]/P1_11-EMC_CLK0" /*!<@brief Label */
#define BOARD_INITPINS_EMC_CLK0_NAME "EMC_CLK0"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name EMC_DYCSN(0) (coord K9), U28[G9]/P1_12-EMC_DYCSn0
  @{ */
#define BOARD_INITPINS_EMC_DYCSn0_PERIPHERAL EMC                   /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_DYCSn0_SIGNAL EMC_DYCS                  /*!<@brief EMC signal: EMC_DYCS */
#define BOARD_INITPINS_EMC_DYCSn0_CHANNEL 0                        /*!<@brief EMC EMC_DYCS channel: 0 */
#define BOARD_INITPINS_EMC_DYCSn0_PIN_NAME EMC_DYCSN(0)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_DYCSn0_LABEL "U28[G9]/P1_12-EMC_DYCSn0" /*!<@brief Label */
#define BOARD_INITPINS_EMC_DYCSn0_NAME "EMC_DYCSn0"                /*!<@brief Identifier name */
                                                                   /* @} */

/*! @name EMC_DQM(0) (coord G10), U28[E8]/P1_13-EMC_DQM0
  @{ */
#define BOARD_INITPINS_EMC_DQM0_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_DQM0_SIGNAL EMC_DQM                 /*!<@brief EMC signal: EMC_DQM */
#define BOARD_INITPINS_EMC_DQM0_CHANNEL 0                      /*!<@brief EMC EMC_DQM channel: 0 */
#define BOARD_INITPINS_EMC_DQM0_PIN_NAME EMC_DQM(0)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_DQM0_LABEL "U28[E8]/P1_13-EMC_DQM0" /*!<@brief Label */
#define BOARD_INITPINS_EMC_DQM0_NAME "EMC_DQM0"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name EMC_DQM(1) (coord C12), U28[F1]/P1_14-EMC_DQM1
  @{ */
#define BOARD_INITPINS_EMC_DQM1_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_DQM1_SIGNAL EMC_DQM                 /*!<@brief EMC signal: EMC_DQM */
#define BOARD_INITPINS_EMC_DQM1_CHANNEL 1                      /*!<@brief EMC EMC_DQM channel: 1 */
#define BOARD_INITPINS_EMC_DQM1_PIN_NAME EMC_DQM(1)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_DQM1_LABEL "U28[F1]/P1_14-EMC_DQM1" /*!<@brief Label */
#define BOARD_INITPINS_EMC_DQM1_NAME "EMC_DQM1"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name EMC_CKE(0) (coord A11), U28[F3]/P1_15-EMC_CKE0
  @{ */
#define BOARD_INITPINS_EMC_CKE0_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_CKE0_SIGNAL EMC_CKE                 /*!<@brief EMC signal: EMC_CKE */
#define BOARD_INITPINS_EMC_CKE0_CHANNEL 0                      /*!<@brief EMC EMC_CKE channel: 0 */
#define BOARD_INITPINS_EMC_CKE0_PIN_NAME EMC_CKE(0)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_CKE0_LABEL "U28[F3]/P1_15-EMC_CKE0" /*!<@brief Label */
#define BOARD_INITPINS_EMC_CKE0_NAME "EMC_CKE0"                /*!<@brief Identifier name */
                                                               /* @} */

