vpecanins/lpc54608_demos/board/pin_mux.h
/*! @name EMC_A(10) (coord B7), U28[H9]/P1_16-EMC_A10
  @{ */
#define BOARD_INITPINS_EMC_A10_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A10_SIGNAL EMC_A                  /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A10_CHANNEL 10                    /*!<@brief EMC EMC_A channel: 10 */
#define BOARD_INITPINS_EMC_A10_PIN_NAME EMC_A(10)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A10_LABEL "U28[H9]/P1_16-EMC_A10" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A10_NAME "EMC_A10"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name EMC_D(8) (coord L1), U28[E1]/RP4[4]/P1_19-EMC_D8
  @{ */
#define BOARD_INITPINS_EMC_D8_PERIPHERAL EMC                      /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D8_SIGNAL EMC_D                        /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D8_CHANNEL 8                           /*!<@brief EMC EMC_D channel: 8 */
#define BOARD_INITPINS_EMC_D8_PIN_NAME EMC_D(8)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D8_LABEL "U28[E1]/RP4[4]/P1_19-EMC_D8" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D8_NAME "EMC_D8"                       /*!<@brief Identifier name */
                                                                  /* @} */

/*! @name EMC_D(9) (coord M1), U28[D2]/RP4[3]/P1_20-EMC_D9
  @{ */
#define BOARD_INITPINS_EMC_D9_PERIPHERAL EMC                      /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D9_SIGNAL EMC_D                        /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D9_CHANNEL 9                           /*!<@brief EMC EMC_D channel: 9 */
#define BOARD_INITPINS_EMC_D9_PIN_NAME EMC_D(9)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D9_LABEL "U28[D2]/RP4[3]/P1_20-EMC_D9" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D9_NAME "EMC_D9"                       /*!<@brief Identifier name */
                                                                  /* @} */

/*! @name EMC_D(10) (coord N8), U28[D1]/RP4[2]/P1_21-EMC_D10
  @{ */
#define BOARD_INITPINS_EMC_D10_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D10_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D10_CHANNEL 10                           /*!<@brief EMC EMC_D channel: 10 */
#define BOARD_INITPINS_EMC_D10_PIN_NAME EMC_D(10)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D10_LABEL "U28[D1]/RP4[2]/P1_21-EMC_D10" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D10_NAME "EMC_D10"                       /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name EMC_A(11) (coord M10), U28[G2]/P1_23-EMC_A11
  @{ */
#define BOARD_INITPINS_EMC_A11_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A11_SIGNAL EMC_A                  /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A11_CHANNEL 11                    /*!<@brief EMC EMC_A channel: 11 */
#define BOARD_INITPINS_EMC_A11_PIN_NAME EMC_A(11)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A11_LABEL "U28[G2]/P1_23-EMC_A11" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A11_NAME "EMC_A11"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name EMC_A(12) (coord N14), U28[G1]/P1_24-EMC_A12
  @{ */
#define BOARD_INITPINS_EMC_A12_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A12_SIGNAL EMC_A                  /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A12_CHANNEL 12                    /*!<@brief EMC EMC_A channel: 12 */
#define BOARD_INITPINS_EMC_A12_PIN_NAME EMC_A(12)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A12_LABEL "U28[G1]/P1_24-EMC_A12" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A12_NAME "EMC_A12"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name EMC_A(13) (coord M12), U28[G7]/P1_25-EMC_A13
  @{ */
#define BOARD_INITPINS_EMC_A13_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A13_SIGNAL EMC_A                  /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A13_CHANNEL 13                    /*!<@brief EMC EMC_A channel: 13 */
#define BOARD_INITPINS_EMC_A13_PIN_NAME EMC_A(13)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A13_LABEL "U28[G7]/P1_25-EMC_A13" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A13_NAME "EMC_A13"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name EMC_A(8) (coord J10), U28[H1]/P1_26-EMC_A8
  @{ */
#define BOARD_INITPINS_EMC_A8_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A8_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A8_CHANNEL 8                    /*!<@brief EMC EMC_A channel: 8 */
#define BOARD_INITPINS_EMC_A8_PIN_NAME EMC_A(8)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A8_LABEL "U28[H1]/P1_26-EMC_A8" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A8_NAME "EMC_A8"                /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_A(9) (coord F10), U28[G3]/P1_27-EMC_A9
  @{ */
#define BOARD_INITPINS_EMC_A9_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A9_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A9_CHANNEL 9                    /*!<@brief EMC EMC_A channel: 9 */
#define BOARD_INITPINS_EMC_A9_PIN_NAME EMC_A(9)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A9_LABEL "U28[G3]/P1_27-EMC_A9" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A9_NAME "EMC_A9"                /*!<@brief Identifier name */
                                                           /* @} */

