vpecanins/lpc54608_demos/board/pin_mux.h
/*! @name EMC_D(13) (coord C11), U28[B2]/RP2[3]/P1_29-EMC_D13
  @{ */
#define BOARD_INITPINS_EMC_D13_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D13_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D13_CHANNEL 13                           /*!<@brief EMC EMC_D channel: 13 */
#define BOARD_INITPINS_EMC_D13_PIN_NAME EMC_D(13)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D13_LABEL "U28[B2]/RP2[3]/P1_29-EMC_D13" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D13_NAME "EMC_D13"                       /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name EMC_D(12) (coord E12), U28[C1]/RP2[4]/P1_28-EMC_D12
  @{ */
#define BOARD_INITPINS_EMC_D12_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D12_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D12_CHANNEL 12                           /*!<@brief EMC EMC_D channel: 12 */
#define BOARD_INITPINS_EMC_D12_PIN_NAME EMC_D(12)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D12_LABEL "U28[C1]/RP2[4]/P1_28-EMC_D12" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D12_NAME "EMC_D12"                       /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name EMC_D(14) (coord A8), U28[B1]/RP2[2]/P1_30-EMC_D14
  @{ */
#define BOARD_INITPINS_EMC_D14_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D14_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D14_CHANNEL 14                           /*!<@brief EMC EMC_D channel: 14 */
#define BOARD_INITPINS_EMC_D14_PIN_NAME EMC_D(14)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D14_LABEL "U28[B1]/RP2[2]/P1_30-EMC_D14" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D14_NAME "EMC_D14"                       /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name EMC_D(15) (coord C5), U28[A2]/RP2[1]/P1_31-EMC_D15
  @{ */
#define BOARD_INITPINS_EMC_D15_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D15_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D15_CHANNEL 15                           /*!<@brief EMC EMC_D channel: 15 */
#define BOARD_INITPINS_EMC_D15_PIN_NAME EMC_D(15)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D15_LABEL "U28[A2]/RP2[1]/P1_31-EMC_D15" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D15_NAME "EMC_D15"                       /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name EMC_A(14) (coord P9), U28[G8]/P3_25-EMC_A14
  @{ */
#define BOARD_INITPINS_EMC_A14_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A14_SIGNAL EMC_A                  /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A14_CHANNEL 14                    /*!<@brief EMC EMC_A channel: 14 */
#define BOARD_INITPINS_EMC_A14_PIN_NAME EMC_A(14)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A14_LABEL "U28[G8]/P3_25-EMC_A14" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A14_NAME "EMC_A14"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name SPIFI_CSN (coord N7), J13[8]/U27[1]/P0_23-SPIFI_CSn-MCLK
  @{ */
/*!
 * @brief Device name: SPIFI0 */
#define BOARD_INITPINS_SPIFI_CSn_PERIPHERAL SPIFI0
/*!
 * @brief SPIFI0 signal: SPIFI_CSN */
#define BOARD_INITPINS_SPIFI_CSn_SIGNAL SPIFI_CSN
/*!
 * @brief Pin name */
#define BOARD_INITPINS_SPIFI_CSn_PIN_NAME SPIFI_CSN
/*!
 * @brief Label */
#define BOARD_INITPINS_SPIFI_CSn_LABEL "J13[8]/U27[1]/P0_23-SPIFI_CSn-MCLK"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_SPIFI_CSn_NAME "SPIFI_CSn"
/* @} */

/*! @name SPIFI_IO(0) (coord M7), J13[6]/U27[5]/P0_24-SPIFI_IO0
  @{ */
#define BOARD_INITPINS_SPIFI_IO0_PERIPHERAL SPIFI0                     /*!<@brief Device name: SPIFI0 */
#define BOARD_INITPINS_SPIFI_IO0_SIGNAL SPIFI_IO0/SPIFI_MOSI           /*!<@brief SPIFI0 signal: SPIFI_IO0/SPIFI_MOSI */
#define BOARD_INITPINS_SPIFI_IO0_PIN_NAME SPIFI_IO(0)                  /*!<@brief Pin name */
#define BOARD_INITPINS_SPIFI_IO0_LABEL "J13[6]/U27[5]/P0_24-SPIFI_IO0" /*!<@brief Label */
#define BOARD_INITPINS_SPIFI_IO0_NAME "SPIFI_IO0"                      /*!<@brief Identifier name */
                                                                       /* @} */

/*! @name SPIFI_IO(1) (coord K8), J13[4]/U27[2]/P0_25-SPIFI_IO1
  @{ */
#define BOARD_INITPINS_SPIFI_IO1_PERIPHERAL SPIFI0                     /*!<@brief Device name: SPIFI0 */
#define BOARD_INITPINS_SPIFI_IO1_SIGNAL SPIFI_IO1/SPIFI_MISO           /*!<@brief SPIFI0 signal: SPIFI_IO1/SPIFI_MISO */
#define BOARD_INITPINS_SPIFI_IO1_PIN_NAME SPIFI_IO(1)                  /*!<@brief Pin name */
#define BOARD_INITPINS_SPIFI_IO1_LABEL "J13[4]/U27[2]/P0_25-SPIFI_IO1" /*!<@brief Label */
#define BOARD_INITPINS_SPIFI_IO1_NAME "SPIFI_IO1"                      /*!<@brief Identifier name */
                                                                       /* @} */

/*! @name SPIFI_CLK (coord M13), J13[2]/U27[6]/P0_26-SPIFI_CLK
  @{ */
#define BOARD_INITPINS_SPIFI_CLK_PERIPHERAL SPIFI0                     /*!<@brief Device name: SPIFI0 */
#define BOARD_INITPINS_SPIFI_CLK_SIGNAL SPIFI_SCK                      /*!<@brief SPIFI0 signal: SPIFI_SCK */
#define BOARD_INITPINS_SPIFI_CLK_PIN_NAME SPIFI_CLK                    /*!<@brief Pin name */
#define BOARD_INITPINS_SPIFI_CLK_LABEL "J13[2]/U27[6]/P0_26-SPIFI_CLK" /*!<@brief Label */
#define BOARD_INITPINS_SPIFI_CLK_NAME "SPIFI_CLK"                      /*!<@brief Identifier name */
                                                                       /* @} */

/*! @name SPIFI_IO(3) (coord L9), J13[12]/U27[7]/P0_27-SPIFI_IO3
  @{ */
/*!
 * @brief Device name: SPIFI0 */
#define BOARD_INITPINS_SPIFI_IO3_PERIPHERAL SPIFI0
/*!
 * @brief SPIFI0 signal: SPIFI_IO */
#define BOARD_INITPINS_SPIFI_IO3_SIGNAL SPIFI_IO
/*!
 * @brief SPIFI0 SPIFI_IO channel: 3 */
#define BOARD_INITPINS_SPIFI_IO3_CHANNEL 3
/*!
 * @brief Pin name */
#define BOARD_INITPINS_SPIFI_IO3_PIN_NAME SPIFI_IO(3)
/*!
 * @brief Label */
#define BOARD_INITPINS_SPIFI_IO3_LABEL "J13[12]/U27[7]/P0_27-SPIFI_IO3"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_SPIFI_IO3_NAME "SPIFI_IO3"
/* @} */

/*! @name SPIFI_IO(2) (coord M9), J13[10]/U27[3]/P0_28-SPIFI_IO2-USB0_OCURRn
  @{ */
/*!
 * @brief Device name: SPIFI0 */
#define BOARD_INITPINS_SPIFI_IO2_PERIPHERAL SPIFI0
/*!
 * @brief SPIFI0 signal: SPIFI_IO */
#define BOARD_INITPINS_SPIFI_IO2_SIGNAL SPIFI_IO
/*!
 * @brief SPIFI0 SPIFI_IO channel: 2 */
#define BOARD_INITPINS_SPIFI_IO2_CHANNEL 2
/*!
 * @brief Pin name */
#define BOARD_INITPINS_SPIFI_IO2_PIN_NAME SPIFI_IO(2)
/*!
 * @brief Label */
#define BOARD_INITPINS_SPIFI_IO2_LABEL "J13[10]/U27[3]/P0_28-SPIFI_IO2-USB0_OCURRn"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_SPIFI_IO2_NAME "SPIFI_IO2"
/* @} */

/*! @name PIO3_3 (coord A13), J9[8]/LED2/P3_3-USR_LED2
  @{ */
#define BOARD_INITPINS_LED2_PERIPHERAL GPIO                    /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_LED2_SIGNAL PIO3                        /*!<@brief GPIO signal: PIO3 */
#define BOARD_INITPINS_LED2_GPIO GPIO                          /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LED2_GPIO_PIN 3U                        /*!<@brief PIO3 pin index: 3 */
#define BOARD_INITPINS_LED2_PORT 3U                            /*!<@brief PORT device name: 3U */
#define BOARD_INITPINS_LED2_PIN 3U                             /*!<@brief 3U pin index: 3 */
#define BOARD_INITPINS_LED2_CHANNEL 3                          /*!<@brief GPIO PIO3 channel: 3 */
#define BOARD_INITPINS_LED2_PIN_NAME PIO3_3                    /*!<@brief Pin name */
#define BOARD_INITPINS_LED2_LABEL "J9[8]/LED2/P3_3-USR_LED2"   /*!<@brief Label */
#define BOARD_INITPINS_LED2_NAME "LED2"                        /*!<@brief Identifier name */
#define BOARD_INITPINS_LED2_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                               /* @} */

