vpecanins/lpc54608_demos/board/pin_mux.h
/*! @name PIO3_14 (coord E3), J13[5]/LED1/P3_14-CT3MAT1-USR_LED1
  @{ */
#define BOARD_INITPINS_LED1_PERIPHERAL GPIO                            /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_LED1_SIGNAL PIO3                                /*!<@brief GPIO signal: PIO3 */
#define BOARD_INITPINS_LED1_GPIO GPIO                                  /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LED1_GPIO_PIN 14U                               /*!<@brief PIO3 pin index: 14 */
#define BOARD_INITPINS_LED1_PORT 3U                                    /*!<@brief PORT device name: 3U */
#define BOARD_INITPINS_LED1_PIN 14U                                    /*!<@brief 3U pin index: 14 */
#define BOARD_INITPINS_LED1_CHANNEL 14                                 /*!<@brief GPIO PIO3 channel: 14 */
#define BOARD_INITPINS_LED1_PIN_NAME PIO3_14                           /*!<@brief Pin name */
#define BOARD_INITPINS_LED1_LABEL "J13[5]/LED1/P3_14-CT3MAT1-USR_LED1" /*!<@brief Label */
#define BOARD_INITPINS_LED1_NAME "LED1"                                /*!<@brief Identifier name */
#define BOARD_INITPINS_LED1_DIRECTION kPIN_MUX_DirectionOutput         /*!<@brief Direction */
                                                                       /* @} */

/*! @name PIO2_2 (coord C3), J9[6]/LED3/P2_2-CT1MAT1-USR_LED3
  @{ */
#define BOARD_INITPINS_LED3_PERIPHERAL GPIO                          /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_LED3_SIGNAL PIO2                              /*!<@brief GPIO signal: PIO2 */
#define BOARD_INITPINS_LED3_GPIO GPIO                                /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LED3_GPIO_PIN 2U                              /*!<@brief PIO2 pin index: 2 */
#define BOARD_INITPINS_LED3_PORT 2U                                  /*!<@brief PORT device name: 2U */
#define BOARD_INITPINS_LED3_PIN 2U                                   /*!<@brief 2U pin index: 2 */
#define BOARD_INITPINS_LED3_CHANNEL 2                                /*!<@brief GPIO PIO2 channel: 2 */
#define BOARD_INITPINS_LED3_PIN_NAME PIO2_2                          /*!<@brief Pin name */
#define BOARD_INITPINS_LED3_LABEL "J9[6]/LED3/P2_2-CT1MAT1-USR_LED3" /*!<@brief Label */
#define BOARD_INITPINS_LED3_NAME "LED3"                              /*!<@brief Identifier name */
#define BOARD_INITPINS_LED3_DIRECTION kPIN_MUX_DirectionOutput       /*!<@brief Direction */
                                                                     /* @} */

/*! @name FC2_CTS_SDA_SSEL0 (coord C2), J11[10]/J9[3]/U10[3]/J17[5]/U19[10]/P3_23-FC2_SDAX
  @{ */
/*!
 * @brief Device name: FLEXCOMM2 */
#define BOARD_INITPINS_FC2_SDAX_PERIPHERAL FLEXCOMM2
/*!
 * @brief FLEXCOMM2 signal: CTS_SDA_SSEL0 */
#define BOARD_INITPINS_FC2_SDAX_SIGNAL CTS_SDA_SSEL0
/*!
 * @brief Pin name */
#define BOARD_INITPINS_FC2_SDAX_PIN_NAME FC2_CTS_SDA_SSEL0
/*!
 * @brief Label */
#define BOARD_INITPINS_FC2_SDAX_LABEL "J11[10]/J9[3]/U10[3]/J17[5]/U19[10]/P3_23-FC2_SDAX"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_FC2_SDAX_NAME "FC2_SDAX"
/* @} */

/*! @name FC2_RTS_SCL_SSEL1 (coord E2), J11[9]/J9[1]/U10[2]/J17[4]/U19[2]/P3_24-FC2_SCLX
  @{ */
/*!
 * @brief Device name: FLEXCOMM2 */
#define BOARD_INITPINS_FC2_SCLX_PERIPHERAL FLEXCOMM2
/*!
 * @brief FLEXCOMM2 signal: RTS_SCL_SSEL1 */
#define BOARD_INITPINS_FC2_SCLX_SIGNAL RTS_SCL_SSEL1
/*!
 * @brief Pin name */
#define BOARD_INITPINS_FC2_SCLX_PIN_NAME FC2_RTS_SCL_SSEL1
/*!
 * @brief Label */
#define BOARD_INITPINS_FC2_SCLX_LABEL "J11[9]/J9[1]/U10[2]/J17[4]/U19[2]/P3_24-FC2_SCLX"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_FC2_SCLX_NAME "FC2_SCLX"
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
